{
  "meta.title": "Invisible Text ( ) - Copy Paste Blank Space Text",
  "meta.description": "Copy and paste invisible characters, blank text, and empty spaces for social media, gaming, and more. Create hidden messages with our invisible text generator.",
  "nav.home": "Home",
  "nav.blog": "Blog",
  "nav.about": "About Us",
  "nav.contact": "Contact",
  "nav.terms": "Terms and Conditions",
  "nav.navigation": "NAVIGATION",
  "nav.features": "Features",
  "nav.usecases": "Use Cases",
  "nav.faqs": "FAQ's",
  "nav.resource": "Blog",
  "nav.legal": "LEGAL",
  "nav.privacy": "Privacy Policy",
  "nav.term": "Terms of Service",
  "foot.contact": "CONTACT",
  "foot.copyrights": "© 2025 InvisibleText.Top. All rights reserved.",

  "hero.title": "INVISIBLE TEXT",
  "hero.subtitle": "Welcome to our free online invisible text generator! Hide messages in plain sight using zero-width characters, color masking, and more",


  "tabs.quickCopy": "Quick Copy",
  "tabs.manualSelect": "Manual Select",
  "tabs.customGenerator": "Custom Generator",
  "tabs.testCopy": "Test & Copy",
  "method1.title": "Method 1 - Copy with a button",
  "method1.description": "Click one of the buttons below to copy an invisible character to your clipboard.",
  "btn.copySmall": "Copy small",
  "btn.copyMedium": "Copy medium",
  "btn.copyLarge": "Copy large",
  "method1.note": "Click the button above to copy an invisible character to your clipboard. If this doesn't work on your device, use method 2 to copy and paste blank space.",


  "method2.title": "Method 2 - Copy Blank Space manually",
  "method2.description": "Manually select and copy the empty character from the dashed text area below. You can click the Select button under the text area. Invisible character will be selected, then press [CTRL+C (for Windows) or CMD+C (for MacOS)] to copy.",
  "method2.select": "Select",
  "method2.note": "After selecting the invisible character, press Ctrl+C (Windows) or Cmd+C (Mac) to copy it to your clipboard.",


  "method3.title": "Method 3 - Generate Unlimited Invisible Characters",
  "method3.description": "Type the number of invisible characters you want to generate (from 1-1000), then click the \"Generate\" button.",
  "method3.generate": "Generate",
  "method3.generatedText": "Generated invisible characters:",
  "method3.copy": "Copy",
  "method3.copied": "Copied!",
  "method3.charactersGenerated": "invisible character",
  "method3.charactersGeneratedPlural": "generated",

  "test.title": "Test & Copy Invisible Character",
  "test.description": "Paste invisible characters here to test them or see how many characters are present.",
  "test.placeholder": "Invisible character copy, paste and test here...",
  "test.characters": "Characters:",
  "test.clear": "Clear",
  "test.copy": "Copy",


  "proTip.title": "Pro Tip:",
  "proTip.content": "Different platforms may handle invisible characters differently. If one method doesn't work for your specific use case, try another method or a different number of characters.",

  "whatIs.title": "WHAT IS INVISIBLE TEXT?",
  "whatIs.content1": "Invisible text refers to characters or strings that are present in a document or message but are not visible to the naked eye. This is achieved through various techniques such as using zero-width characters, applying color masking (white text on white background), or utilizing special Unicode characters that have no visible representation.",
  "whatIs.content2": "These invisible characters still exist in the digital space and can be copied, pasted, and transmitted just like regular text. However, they remain hidden from casual observation, making them useful for various applications where discreet communication is desired.",
  
  "howTo.title": "HOW TO COPY-PASTE INVISIBLE TEXT",
  "step1.title": "Choose Method",
  "step1.content": "Select from our quick copy buttons, manual selection, or custom generator options.",
  "step2.title": "Copy",
  "step2.content": "Copy the invisible characters to your clipboard with a single click.",
  "step3.title": "Test & Use",
  "step3.content": "Test your invisible text in our testing area, then use it anywhere you need it.",
  "whyUse.title": "WHY WOULD YOU NEED INVISIBLE TEXT?",
  "privacy.title": "Privacy & Discretion",
  "privacy.content": "Invisible text allows you to hide messages in plain sight, providing an additional layer of privacy for sensitive information that you don't want to be immediately visible.",

  "creative.title": "Creative Uses",
  "creative.content": "Create unique usernames in games, send blank messages on social platforms, or add hidden watermarks to your content to track unauthorized copying.",
  "steganography.title": "Digital Steganography",
  "steganography.content": "Hide messages within other messages or documents, allowing for covert communication that doesn't draw attention to itself.",
  "accessibility.title": "Accessibility",
  "accessibility.content": "Add hidden context or metadata to content that can be accessed by screen readers or other assistive technologies without affecting visual presentation.",
  "whoUses.title": "WHO USES INVISIBLE TEXT?",
  "gamers.title": "Gamers",
  "gamerscontent": "Players of games like Free Fire, PUBG, and other online games use invisible characters to create unique, minimal usernames that stand out or appear blank.",
  "whoUse.socialMedia.title": "Social Media Users",
  "whoUse.socialMedia.content": "People who want to create unique profiles, send blank messages, or hide information within regular posts on platforms like Instagram, Twitter, and Discord.",
  "contentcreator.title": "Content Creators",
  "contentcreator.content": "Writers, designers, and digital artists who want to add hidden watermarks or metadata to their work to track unauthorized use.",
  "features.title": "FEATURES OF OUR INVISIBLE TEXT TOOL",
  "methods.title": "Multiple Invisibility Methods",
  "methods.content": "Choose from various techniques including zero-width characters, color masking, and more.",
  "quickCopy.title": "Quick Copy Buttons",
  "quickCopy.content": "Instantly copy small, medium, or large invisible characters with a single click.",
  "customGenerator.title": "Custom Generator",
  "customGenerator.content": "Generate any number of invisible characters from 1 to infinity with our custom generator.",
  "testingArea.title": "Testing Area",
  "testingArea.content": "Test your invisible characters before using them to ensure they work as expected.",
  "counter.title": "Character Counter",
  "counter.content": "See exactly how many invisible characters you've generated or pasted.",
  "encoding.title": "Advanced Text Encoding",
  "encoding.content": "Hide entire messages within invisible characters that can be decoded later.",
  "benefits.title": "BENEFITS OF USING INVISIBLETEXT.pro",
  "free.title": "100% Free",
  "free.content": "No hidden fees or premium features locked behind paywalls.",
  "noRegistration.title": "No Registration Required",
  "noRegistration.content": "Use our tool instantly without creating an account.",

  "privacy.title2": "Privacy-Focused",
  "privacy.content2": "We don't store your text or track your usage.",
  "userFriendly.title": "User-Friendly Interface",
  "userFriendly.content": "Simple, intuitive design that anyone can use.",
  "moreMethods.title": "More Methods Than Competitors",
  "moreMethods.content": "We offer more ways to create and use invisible text than any other tool.",
  "mobileFriendly.title": "Mobile-Friendly",
  "mobileFriendly.content": "Works perfectly on smartphones and tablets.",
  "useCases.title": "PRACTICAL USE CASES",
  "gaming.title": "Gaming",
  "gaming.content": "Create unique \"invisible\" usernames in games like Free Fire, PUBG, and other online games to stand out from other players.",
  "gaming.example": "PlayerName: \"⁣ ⁣\"",
  "gaming.note": "(Appears as a blank or minimal username)",

  "socialMedia.title": "Social Media",
  "socialMedia.content": "Send blank messages on platforms like WhatsApp, Telegram, or Discord, or create unique-looking profiles.",
  "socialMedia.example": "Message: \"⁣ ⁣\"",
  "socialMedia.note": "(Appears as an empty message but can be copied and decoded)",

  "watermarking.title": "Digital Watermarking",
  "watermarking.content": "Add invisible signatures to your content that can be used to verify authenticity or track unauthorized copying.",
  "watermarking.example.content": "Example:",
  "watermarking.example": "Document: \"This is my content‍‌‍‌‍‌‍‌.\"",
  "watermarking.note": "(Contains hidden watermark that's invisible to readers)",
  "hiddenMessages.title": "Hidden Messages",
  "hiddenMessages.content": "Embed secret messages within regular text that can only be revealed by those who know to look for them.",
  "hiddenMessages.example": "Example:",
  "hiddenMessages.examplecontent": "Public post: \"Great weather today!‍‌‍‌‍‌‍‌\"",
  "hiddenMessages.note": "(Contains hidden message: \"Meet at 5pm\")",
  "faq.title": "FREQUENTLY ASKED QUESTIONS",
  "faq.question": "Is invisible text really invisible?",
  "faq.answer": "Yes, invisible text is not visible to the naked eye when viewed normally. However, it can be revealed by selecting the text, using our decoder tool, or through certain text editors that display special characters.",
  "faq.question2": "Will invisible text work on all platforms?",
  "faq.answer2": "Most invisible text methods work across a wide range of platforms including social media, messaging apps, and games. However, some platforms may have restrictions or filters that affect how invisible text is displayed.",
  "faq.question3": "Is using invisible text allowed in games?",
  "faq.answer3": "This depends on the specific game's terms of service. Some games may consider using invisible characters for usernames as a violation of their rules. Always check the game's policies before using invisible text.",
  "faq.question4": "How do I decode invisible text?",
  "faq.answer4": "You can decode invisible text by using our \"Test & Copy\" area. Simply paste the text containing invisible characters, and our tool will show you the character count and allow you to see the hidden content.",
  "faq.question5": "What's the difference between the small, medium, and large invisible characters?",
  "faq.answer5": "The small, medium, and large options refer to the number of invisible characters generated. Small creates 1 character, medium creates 5 characters, and large creates 10 characters. More characters can make the invisible text more robust on certain platforms.",

  "footer.copyright": "© 2025 invisibletext.pro. All rights reserved.",
  "footer.navigation": "Navigation",
  "footer.legal": "Legal",
  "footer.contact": "Contact"
}